ByDesignAPIClientSolution/ByDesignSoapClient.Api/xmlfiles/customerRequirement.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
  <soapenv:Header />
  <soapenv:Body>
    <glob:CustReqBundleMaintainRequest_sync>
      <CustomerRequirement ActionCode="01">
<ShipFromSiteID>G1000</ShipFromSiteID><ShipToSiteID>G2000</ShipToSiteID><ShipToLocationID>1000151</ShipToLocationID><CompleteDeliveryRequestedIndicator>true</CompleteDeliveryRequestedIndicator><DeliveryPriorityCode>3</DeliveryPriorityCode><ExternalRquestItem><ObjectNodeSenderTechnicalID>1010</ObjectNodeSenderTechnicalID><ItemID>10</ItemID><ProductKey><ProductTypeCode /><ProductIdentifierTypeCode /><ProductID>110354</ProductID></ProductKey><RequestedQuantity unitCode="XCT">900</RequestedQuantity><RequestedLocalDateTime timeZoneCode="UTC+1">2019-09-03T00:00:00Z</RequestedLocalDateTime><Description languageCode="EN">Warfarin (Teva) 3mg x28</Description></ExternalRquestItem>
</CustomerRequirement>
</glob:CustReqBundleMaintainRequest_sync>
  </soapenv:Body>
</soapenv:Envelope>